# Task 1.1
# Найдите сумму цифр трёхзначного числа:
# 123 = 6(1+2+3)
# 100 = 1(1 + 0 + 0)

num = int(input('Введите число: '))
a = num // 100
b = num // 10 % 10
c = num % 10
print (a + b + c)


